; domain
(define (domain tankyard)
    (:requirements :strips :typing :equality :adl :fluents)
    (:types tank)
  (:predicates
    (idle ?x - tank)
  )

    (:functions
        (level ?c - tank);; - int  ;; The value shown in counter ?c
        (flowrate ?c - tank);;
        (capacity);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action fill
         :parameters (?c - tank)
         :precondition (and (<= (+ (level ?c) (flowrate ?c)) (capacity)))
         :effect (and (increase (level ?c) (flowrate ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action drain
         :parameters (?c - tank)
         :precondition (and (>= (- (level ?c) (flowrate ?c)) 0))
         :effect (and (decrease (level ?c) (flowrate ?c)))
    )

    (:action open_valve
         :parameters (?c - tank)
         :precondition (and (<= (+ (flowrate ?c) 1) 10))
         :effect (and (increase (flowrate ?c) 1))
    )

    (:action close_valve
         :parameters (?c - tank)
         :precondition (and (>= (flowrate ?c) 1))
         :effect (and (decrease (flowrate ?c) 1))
    )
)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem tankyard-p02)
	(:domain tankyard)
	(:objects
		tank0 tank1 tank2 - tank
	)
  (:init
		(= (level tank0) 20)
	(= (level tank1) 74)
	(= (level tank2) 43)

        (= (flowrate tank0) 0)
	(= (flowrate tank1) 0)
	(= (flowrate tank2) 0)

		(= (capacity) 100)
	)
	(:goal
		(and
			(<= (+ (level tank0) 1) (level tank1))
	(<= (+ (level tank1) 1) (level tank2))
		)
	)
)

; plan
1. (open_valve tank2)
   changed: (flowrate tank2) from 0 to 1
   goals met: 1 of 2
2. (fill tank2)
   changed: (level tank2) from 43 to 44
   goals met: 1 of 2
3. (fill tank2)
   changed: (level tank2) from 44 to 45
   goals met: 1 of 2
4. (fill tank2)
   changed: (level tank2) from 45 to 46
   goals met: 1 of 2
5. (fill tank2)
   changed: (level tank2) from 46 to 47
   goals met: 1 of 2
6. (fill tank2)
   changed: (level tank2) from 47 to 48
   goals met: 1 of 2
7. (fill tank2)
   changed: (level tank2) from 48 to 49
   goals met: 1 of 2
8. (fill tank2)
   changed: (level tank2) from 49 to 50
   goals met: 1 of 2
9. (fill tank2)
   changed: (level tank2) from 50 to 51
   goals met: 1 of 2
10. (fill tank2)
   changed: (level tank2) from 51 to 52
   goals met: 1 of 2
11. (fill tank2)
   changed: (level tank2) from 52 to 53
   goals met: 1 of 2
12. (fill tank2)
   changed: (level tank2) from 53 to 54
   goals met: 1 of 2
13. (fill tank2)
   changed: (level tank2) from 54 to 55
   goals met: 1 of 2
14. (fill tank2)
   changed: (level tank2) from 55 to 56
   goals met: 1 of 2
15. (fill tank2)
   changed: (level tank2) from 56 to 57
   goals met: 1 of 2
16. (fill tank2)
   changed: (level tank2) from 57 to 58
   goals met: 1 of 2
17. (fill tank2)
   changed: (level tank2) from 58 to 59
   goals met: 1 of 2
18. (fill tank2)
   changed: (level tank2) from 59 to 60
   goals met: 1 of 2
19. (fill tank2)
   changed: (level tank2) from 60 to 61
   goals met: 1 of 2
20. (fill tank2)
   changed: (level tank2) from 61 to 62
   goals met: 1 of 2
21. (fill tank2)
   changed: (level tank2) from 62 to 63
   goals met: 1 of 2
22. (fill tank2)
   changed: (level tank2) from 63 to 64
   goals met: 1 of 2
23. (fill tank2)
   changed: (level tank2) from 64 to 65
   goals met: 1 of 2
24. (fill tank2)
   changed: (level tank2) from 65 to 66
   goals met: 1 of 2
25. (fill tank2)
   changed: (level tank2) from 66 to 67
   goals met: 1 of 2
26. (fill tank2)
   changed: (level tank2) from 67 to 68
   goals met: 1 of 2
27. (fill tank2)
   changed: (level tank2) from 68 to 69
   goals met: 1 of 2
28. (fill tank2)
   changed: (level tank2) from 69 to 70
   goals met: 1 of 2
29. (fill tank2)
   changed: (level tank2) from 70 to 71
   goals met: 1 of 2
30. (fill tank2)
   changed: (level tank2) from 71 to 72
   goals met: 1 of 2
31. (fill tank2)
   changed: (level tank2) from 72 to 73
   goals met: 1 of 2
32. (fill tank2)
   changed: (level tank2) from 73 to 74
   goals met: 1 of 2
33. (fill tank2)
   changed: (level tank2) from 74 to 75
   goals met: 2 of 2
